"use client";

import Box from "@/components/Box";
import Description from "@/components/Description";
import NavbarTitle from "@/components/NavbarTitle";

export default function PrivacyPolicy() {
  return (
    <div className="p-7.5 grid gap-10">
      <NavbarTitle title="سیاست حریم خصوصی" />

      <div className="grid gap-5">
        <Description>
          <span className="font-bold text-black">
            استفاده از برنامه‌ی جیب به معنای پذیرفتن این سیاست حریم خصوصی هست.
          </span>
        </Description>

        <Description>
          امنیت اطلاعات شما برای ما خیلی مهمه، این سند توضیح میده که برنامه‌ی
          مدیریت مالی «جیب» چطوری با اطلاعات شما رفتار میکنه. برنامه جیب با
          رویکرد حفظ حداکثری امنیت و حریم خصوصی کاربران طراحی شده.
        </Description>
      </div>

      <Box>
        <h3 className="text-sm">۱. ذخیره‌سازی اطلاعات</h3>
        <Description>
          تمام اطلاعات شما (شامل حساب‌ها، تراکنش‌ها، برچسب‌ها و موجودی‌ها) به
          صورت کاملاً محلی در حافظه مرورگر یا دستگاه شما (از طریق پایگاه داده
          IndexedDB) ذخیره میشه.
        </Description>

        <Description>
          <span className="font-bold text-black">
            اطلاعات شما هرگز به هیچ سرور، سرویس ابری یا پایگاه داده خارجی ارسال
            نمی‌شه.
          </span>{" "}
          ما به اطلاعات مالی شما دسترسی نداریم و اون‌ها رو نمی‌بینیم.
        </Description>
      </Box>

      <Box>
        <h3 className="text-sm">۲. حساب کاربری</h3>
        <Description>
          برنامه جیب برای استفاده نیازی به ساخت حساب کاربری، وارد کردن شماره
          موبایل، ایمیل یا هرگونه اطلاعات هویتی نداره. به همین دلیل، هیچ اطلاعات
          شخصی از شما برای شناسایی جمع‌آوری نمی‌شه.
        </Description>
      </Box>

      <Box>
        <h3 className="text-sm">۳. پشتیبان‌گیری و انتقال داده‌ها</h3>
        <Description>
          مسئولیت پشتیبان‌گیری از اطلاعات کاملاً بر عهده شماست. شما میتونین از
          بخش «پشتیبان‌گیری و بازیابی»، داده‌های خودتون رو در قالب فایل‌های با
          پسوند{" "}
          <span className="font-bold text-black" dir="ltr">
            .pback
          </span>{" "}
          در دستگاه خودتون ذخیره کنین.
        </Description>

        <Description>
          این فایل‌ها مستقیماً در حافظه دستگاه شما ایجاد میشن و برنامه هیچ نقشی
          در ارسال یا ذخیره آن‌ها در فضاهای ابری نداره. امنیت نگهداری این
          فایل‌ها بر عهده شماست.
        </Description>
      </Box>

      <Box>
        <h3 className="text-sm">۴. دسترسی به فایل‌های دستگاه</h3>
        <Description>
          برنامه جیب تنها در زمانی که شما شخصاً اقدام به بارگذاری (آپلود) فایل
          پشتیبان (
          <span className="font-bold text-black" dir="ltr">
            .pback
          </span>
          ) یا فایل اکسل (
          <span className="font-bold text-black" dir="ltr">
            .xlsx
          </span>
          ) برای بازیابی یا وارد کردن اطلاعات می‌کنین، به فایل‌های دستگاه شما
          دسترسی پیدا می‌کنه. این دسترسی صرفاً برای خوندن فایلی هست که شما
          انتخاب کردید.
        </Description>
      </Box>

      <Box>
        <h3 className="text-sm">۵. ابزارهای ردیابی و تبلیغات</h3>
        <Description>
          این برنامه از هیچ‌گونه ابزار ردیاب (Tracker)، کوکی‌های شخص ثالث،
          تحلیل‌گرهای رفتار کاربر (مانند Google Analytics) و یا شبکه‌های
          تبلیغاتی استفاده نمی‌کنه. هیچ اطلاعاتی درباره نحوه استفاده شما از
          برنامه جمع‌آوری نمی‌شه.
        </Description>
      </Box>

      <Box>
        <h3 className="text-sm">۶. حذف اطلاعات</h3>
        <Description>
          از اونجایی‌که داده‌ها به صورت محلی ذخیره میشن، در موارد زیرتمام
          اطلاعات مالی شما به صورت دائمی و غیرقابل بازیابی پاک میشه:
          <br />- اگه داده‌های مرورگر/برنامه رو پاک کنید
          <br />- یا از بخش «حذف همه اطلاعات» در برنامه استفاده کنید
          <br />- یا برنامه رو حذف کنید
        </Description>

        <Description>
          ما نسخه‌ی پشتیبان از داده‌های شما نداریم تا در صورت اشتباه اون رو
          برگردونیم، درنتیجه، پشتیبان‌گیری منظم به عهده‌ی خودتون هست.
        </Description>
      </Box>

      <Box>
        <h3 className="text-sm">۷. تغییرات در سیاست حریم خصوصی</h3>
        <Description>
          در صورت اضافه شدن ویژگی‌های جدید به برنامه، این سند به‌روزرسانی میشه.
          در حال حاضر، ماهیت آفلاین برنامه به معنای حریم خصوصی مطلق برای اطلاعات
          مالی شماست.
        </Description>
      </Box>
    </div>
  );
}
